Revit 2027 API
InsulationLiningBase.GetLiningIds Method
 Returns the ids of the lining elements associated to a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetLiningIds(
	Document document,
	ElementId elemId
)
Public Shared Function GetLiningIds (
	document As Document,
	elemId As ElementId
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetLiningIds(
	Document^ document,
	ElementId^ elemId
)
static member GetLiningIds :
        document : Document *
        elemId : ElementId -> ICollection<ElementId>
Parameters
document Document
 The document.
elemId ElementId
 The element.
Return Value
ICollection<ElementId>
 A collection of the ids of the lining elements.
Exceptions
Exception | Condition
ArgumentException |  This id does not represent a duct, fitting, or accessory element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InsulationLiningBase Class
Autodesk.Revit.DB Namespace